import requests

port = 2000

url = f"http://localhost:{port}/predict/"

text = "फिल्म ‘इभन होयन आइ फल’ मा बेचविखनमा परेका महिला र ‘सर्कस काठमाडौं’को कथा समेटिएको छ। फिल्मलाई स्काई नेयल र केट मेक्लारनाेनले निर्देशन गरेका हुन्"


def text_example(text):
    return {
        "params": text
    }


example = text_example(text)
prediction = requests.post(url, json=example).json()

print(prediction)
# examples ->


"""
1. स्ट्राइइकर पिरे इमेरिक औबामेयाङको दुई गोलमा आर्सनलले आइतबार स्टोक सिटीलाई ३–० ले पराजित गरेको छ।

2. फिल्म ‘इभन होयन आइ फल’ मा बेचविखनमा परेका महिला र ‘सर्कस काठमाडौं’को कथा समेटिएको छ। फिल्मलाई स्काई नेयल र केट मेक्लारनाेनले निर्देशन गरेका हुन्

3. फिल्म र विवादको नाता धेरै पुरानो हो। फिल्ममा समाविष्ट दृश्यका मध्यनजर थुप्रै पटक विभिन्न फिल्महरू विभिन्न समयमा कयौं देशमा प्रतिबन्धित हुन पुगेका छन्। यस्ता फिल्महरूको सुचि लामै छ।

"""
